{
  "articles": [
    {
      "source": {
        "id": null,
        "name": "Kotaku"
      },
      "author": "Sisi Jiang",
      "title": "Old G4 Review Is Forcing Gaming To Reckon With Its Racist JRPG Past",
      "description": "Last week, Final Fantasy producer Yoshida Naoki objected to the label “JRPG,” stating that the term felt “discriminatory.” His comments kicked off a round of discussion about whether or not the term “JRPG” was racially problematic. Some couldn’t understand ho…",
      "url": "https://kotaku.com/g4-jrpg-racist-baten-kaitos-origins-final-fantasy-1850193005",
      "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/763a8fb8dbfa4adf0380512764b16251.jpg",
      "publishedAt": "2023-03-06T18:07:04Z",
      "content": "Last week, Final Fantasy producer Yoshida Naoki objected to the label JRPG, stating that the term felt discriminatory. His comments kicked off a round of discussion about whether or not the term JRPG… [+3650 chars]"
    },
    {
      "source": {
        "id": "polygon",
        "name": "Polygon"
      },
      "author": "Austen Goslin",
      "title": "Creed 3’s box office returns are already breaking records",
      "description": "Michael B. Jordan’s Creed 3 now has the biggest opening of any Rocky movie — and the biggest opening of any sports movie ever made.",
      "url": "https://www.polygon.com/23627357/creed-3-box-office-total-rocky-sports-movies",
      "urlToImage": "https://cdn.vox-cdn.com/thumbor/70xrj4JTdUgKEj6r_chhNOC99oE=/0x0:3000x1571/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24456443/creed_iii_C3_21845_R_rgb.jpg",
      "publishedAt": "2023-03-06T22:58:00Z",
      "content": "The third film in the Creed trilogy has arrived and star/director Michael B. Jordans franchise is showing no signs of slowing down. Creed 3 opened to impressive box office returns, earning nearly $59… [+1173 chars]"
    },
    {
      "source": {
        "id": "polygon",
        "name": "Polygon"
      },
      "author": "Michael McWhertor",
      "title": "Overwatch 2’s One-Punch Man crossover adds Genos Genji",
      "description": "Blizzard’s One-Punch Man collab for Overwatch 2 reveals its third skin: a Genos-inspired cosplay outfit for cyborg ninja Genji.",
      "url": "https://www.polygon.com/23627503/overwatch-2-one-punch-man-genos-genji",
      "urlToImage": "https://cdn.vox-cdn.com/thumbor/MeCwAec8mmlIpEG6ud_XiQd8k14=/0x0:2048x1072/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24483613/genji_ganos.jpg",
      "publishedAt": "2023-03-06T18:02:39Z",
      "content": "On the eve of Overwatch 2s crossover with anime and manga series One-Punch Man, Blizzard Entertainment has revealed the third character coming to its hero shooter: the cyborg Genos. Overwatchs own cy… [+1073 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Digital Trends"
      },
      "author": "Tomas Franzese",
      "title": "Popular city-builder Cities: Skylines is getting a sequel this year",
      "description": "Developer Paradox Interactive hosted a livestream today that revealed a sequel to Cities: Skylines is coming this year.",
      "url": "https://www.digitaltrends.com/gaming/cities-skylines-2-announced/",
      "urlToImage": "https://www.digitaltrends.com/wp-content/uploads/2023/03/Cities-Skylines-2.jpg?resize=1200%2C630&p=1",
      "publishedAt": "2023-03-06T18:35:42Z",
      "content": "Tomb Raider Reloaded, a roguelike mobile game based on Crystal Dynamics' long-running series, has been unveiled ahead of its release on iOS, Android, and Netflix on February 14.Tomb Raider Reloaded i… [+12037 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "HYPEBEAST"
      },
      "author": "info@hypebeast.com (Hypebeast)",
      "title": "Ash and Pikachu's Final 'Pokémon' Anime Episode Will See Rival Gary Return",
      "description": "Aside from getting a trailer for the new Pokémon series, we now have a summary of Ash and Pikachu's final Pokémon anime episode. Titled \"Rainbow and the Pokémon Master!,\" the synopsis shared by a Japanese TV guide reveals that the episode will see Ash and his…",
      "url": "https://hypebeast.com/2023/3/pokemon-ash-pikachu-final-episode-summary-info",
      "urlToImage": "https://image-cdn.hypb.st/https%3A%2F%2Fhypebeast.com%2Fimage%2F2023%2F03%2Fpokemon-ash-pikachu-final-episode-summary-new-season-trailer-info-tw.jpg?w=960&cbr=1&q=90&fit=max",
      "publishedAt": "2023-03-06T06:22:23Z",
      "content": "Aside from getting a trailer for the new Pokémon series, we now have a summary of Ash and Pikachu’s final Pokémon anime episode. Titled “Rainbow and the Pokémon Master!,” the synopsis shared by a Jap… [+1260 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "HYPEBEAST"
      },
      "author": "info@hypebeast.com (Hypebeast)",
      "title": "D4vd Is Here to Stay",
      "description": "If you've scrolled through TikTok or Instagram Reels, you're bound to have listened to one of d4vd's dreamy tunes such as his breakout track \"Romantic Homicide\" or \"Here With Me,\" which between the two, now have over 780 million cumulative plays on Spotify al…",
      "url": "https://hypebeast.com/2023/3/d4vd-artist-q-and-a-interview-info",
      "urlToImage": "https://image-cdn.hypb.st/https%3A%2F%2Fhypebeast.com%2Fimage%2F2023%2F03%2Fd4vd-artist-q-and-a-interview-info-tw-1.jpg?w=960&cbr=1&q=90&fit=max",
      "publishedAt": "2023-03-06T16:10:47Z",
      "content": "If you’ve scrolled through TikTok or Instagram Reels, you’re bound to have listened to one of d4vd‘s dreamy tunes such as his breakout track “Romantic Homicide” or “Here With Me,” which between the t… [+8833 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Espinof.com"
      },
      "author": "Carla Monfort",
      "title": "'Shingeki no Kyojin', 'Spy x Family' y 'Kimetsu no Yaiba' arrasan en los Anime Awards 2023 de Crunchyroll pero el mejor anime del año está en Netflix",
      "description": "En la madrugada del 4 de marzo, Crunchyroll celebró la gala de los Anime Awards. Se anunciaron los premiados, todos ellos elegidos mediante los votos de los usuarios de Crunchyroll. Los premios engloban los animes emitidos entre noviembre de 2021 y septiembre…",
      "url": "https://www.espinof.com/listas/shingeki-no-kyojin-spy-x-family-kimetsu-no-yaiba-arrasan-anime-awards-2023-crunchyroll-mejor-anime-ano-esta-netfl",
      "urlToImage": "https://i.blogs.es/08df94/anime-awards-2-/840_560.jpeg",
      "publishedAt": "2023-03-06T10:31:58Z",
      "content": "En la madrugada del 4 de marzo, Crunchyroll celebró la gala de los Anime Awards. Se anunciaron los premiados, todos ellos elegidos mediante los votos de los usuarios de Crunchyroll. Los premios englo… [+6404 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "/FILM"
      },
      "author": "Rafael Motamayor",
      "title": "Demon Slayer: Kimetsu No Yaiba – To The Swordsmith Village Is Yet Another Win For Anime At The Box Office",
      "description": "It's the start of a new week, which means another anime film making big bucks at the box office. At this point, it shouldn't come as a big surprise that the release of an anime film, especially one based on a hugely popular TV show -- let alone one as popular…",
      "url": "https://www.slashfilm.com/1218849/demon-slayer-kimetsu-no-yaiba-to-the-swordsmith-village-is-yet-another-win-for-anime-at-the-box-office/",
      "urlToImage": "https://www.slashfilm.com/img/gallery/demon-slayer-kimetsu-no-yaiba-to-the-swordsmith-village-is-yet-another-win-for-anime-at-the-box-office/l-intro-1678122778.jpg",
      "publishedAt": "2023-03-06T17:26:28Z",
      "content": "The thing about \"Demon Slayer: Kimetsu No Yaiba To the Swordsmith Village\" is that, again, it isn't really a movie. Instead, it's a compilation movie comprised of the last two episodes of season 2, p… [+1312 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "/FILM"
      },
      "author": "Ryan Scott",
      "title": "Creed III Set A Box Office Record For Rocky, All Without Sylvester Stallone",
      "description": "It was, to say the very least, one heck of a weekend at the box office. Michael B. Jordan not only stepped back in the ring as Adonis Creed for \"Creed III,\" but he also directed the film, and did so without the presence of Sylvester Stallone's Rocky Balboa. I…",
      "url": "https://www.slashfilm.com/1218800/creed-iii-set-a-box-office-record-for-rocky-all-without-sylvester-stallone/",
      "urlToImage": "https://www.slashfilm.com/img/gallery/creed-iii-set-a-box-office-record-for-rocky-all-without-sylvester-stallone/l-intro-1678121407.jpg",
      "publishedAt": "2023-03-06T16:52:01Z",
      "content": "Rounding out the top three was \"Cocaine Bear,\" which held pretty well for Universal, taking in $11 million. That represents a 52.6% drop and, considering the competition, that's pretty damn good. If … [+1800 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "/FILM"
      },
      "author": "Devin Meenan",
      "title": "Adonis Isn't Really The Hero Of Creed III, And That's What Makes It Great",
      "description": "This post contains spoilers for \"Creed III.\"\n\"Rocky\" is a mythic saga, but its characters are ultimately human. The first film is the everyman story to end all others: a nobody boxer Rocky Balboa (Sylvester Stallone) taking on world-famous champion Apollo Cre…",
      "url": "https://www.slashfilm.com/1218282/adonis-isnt-really-the-hero-of-creed-iii-and-thats-what-makes-it-great/",
      "urlToImage": "https://www.slashfilm.com/img/gallery/adonis-isnt-really-the-hero-of-creed-iii-and-thats-what-makes-it-great/l-intro-1678061366.jpg",
      "publishedAt": "2023-03-06T01:00:16Z",
      "content": "Adonis' flaws are counterbalanced with a sympathetic villain; it's hard to hate Damian. It's revealed the two were raised in the same abusive foster home together. Years later, Adonis saw their abusi… [+1623 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "/FILM"
      },
      "author": "Andrew Housman",
      "title": "Jonathan Majors Is In The Two Highest Grossing Movies At The Box Office Right Now",
      "description": "Jonathan Majors is on fire right now. The actor is quickly rising to the ranks of superstardom, successfully pulling off back–to-back number one hits at the box office in a feat that few have accomplished in their careers. First, \"Ant-Man and the Wasp: Quantu…",
      "url": "https://www.slashfilm.com/1219277/jonathan-majors-is-in-the-two-highest-grossing-movies-at-the-box-office-right-now/",
      "urlToImage": "https://www.slashfilm.com/img/gallery/jonathan-majors-is-in-the-two-highest-grossing-movies-at-the-box-office-right-now/l-intro-1678136866.jpg",
      "publishedAt": "2023-03-06T21:25:02Z",
      "content": "Majors wasn't the only factor in the box office success of \"Quantumania\" and \"Creed III,\" but his presence still arguably played a key role in their dominance. His surprise appearance as He Who Remai… [+1533 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Vida Extra"
      },
      "author": "Sergio Cejas (Beld)",
      "title": "Cyberpunk: Edgerunners es elegida la mejor serie anime del año en los Crunchyroll Anime Awards 2023",
      "description": "La plataforma Crunchyroll, una de las mejores que existen para todos los aficionados a las series anime, realizó anoche en Japón la séptima edición anual de los premios Crunchyroll Anime Awards. En la susodicha gala se premia a las mejores series en una larga…",
      "url": "https://www.vidaextra.com/series/cyberpunk-edgerunners-elegida-mejor-serie-anime-ano-crunchyroll-anime-awards-2023",
      "urlToImage": "https://i.blogs.es/f5cb21/cyberpunk/840_560.jpeg",
      "publishedAt": "2023-03-06T15:16:00Z",
      "content": "La plataforma Crunchyroll, una de las mejores que existen para todos los aficionados a las series anime, realizó anoche en Japón la séptima edición anual de los premios Crunchyroll Anime Awards. En l… [+11198 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Destructoid"
      },
      "author": "Chris Moyse",
      "title": "Guilty Gear Strive Bridget gets her own Pop Up Parade figurine",
      "description": "Hey Yo, (yo)\nGuilty Gear Strive superstar Bridget is the latest beloved gaming character to join Good Smile Co's \"Pop Up Parade\" range of affordable figurines. The yo-yo swinging scrapper is available to pre-order now at Good Smile Co. and other anime-lovin' …",
      "url": "https://www.destructoid.com/guilty-gear-strive-bridget-pop-up-parade-figurine-pre-order/",
      "urlToImage": "https://www.destructoid.com/wp-content/uploads/2023/03/bridget-guilty-gear-pop-up-parade.jpg?fit=1200%2C795",
      "publishedAt": "2023-03-06T21:30:34Z",
      "content": "Guilty Gear Strive superstar Bridget is the latest beloved gaming character to join Good Smile Co’s “Pop Up Parade” range of affordable figurines. The yo-yo swinging scrapper is available to pre-orde… [+1414 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Destructoid"
      },
      "author": "Chris Moyse",
      "title": "New Dragon Ball Z: Budokai Tenkaichi officially announced",
      "description": "Rock the Dragon\nThere was a pretty big surprise for all Senzu Bean lovers this weekend, as Bandai Namco dropped a reveal for a brand new title in the dormant fighting game series Dragon Ball Z: Budokai Tenkaichi. The new title did not receive an official titl…",
      "url": "https://www.destructoid.com/dragon-ball-z-budokai-tenkaichi-announced-dbz-bandai-namco-teaser/",
      "urlToImage": "https://www.destructoid.com/wp-content/uploads/2023/03/dragon-ball-z-budokai-tenkaichi-4.jpg",
      "publishedAt": "2023-03-06T10:18:36Z",
      "content": "There was a pretty big surprise for all Senzu Bean lovers this weekend, as Bandai Namco dropped a reveal for a brand new title in the dormant fighting game series Dragon Ball Z: Budokai Tenkaichi. Th… [+1282 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Destructoid"
      },
      "author": "Chris Moyse",
      "title": "She’s Baaad: Check out Granblue Fantasy: Versus magic shepherd, Anila",
      "description": "Join the Flock\nArc System Works, in association with publisher CyGames, has released the first gameplay trailer for the adorable Anila, the first new character announced for anime scrapper Granblue Fantasy Versus: Rising. Anila was first revealed in a teaser …",
      "url": "https://www.destructoid.com/shes-baaaaad-check-out-granblue-fantasy-versus-magical-shepherd-anila/",
      "urlToImage": "https://www.destructoid.com/wp-content/uploads/2023/03/granblue-fantasy-versus-rising-anila.jpg?fit=1200%2C705",
      "publishedAt": "2023-03-06T19:30:19Z",
      "content": "Arc System Works, in association with publisher CyGames, has released the first gameplay trailer for the adorable Anila, the first new character announced for anime scrapper Granblue Fantasy Versus: … [+2013 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Eurogamer.net"
      },
      "author": "Ed Nightingale",
      "title": "New Dragon Ball Z: Budokai Tenkaichi announced",
      "description": "A new Dragon Ball Z: Budokai Tenkaichi game has been announced by Bandai Namco.\n\nThis will be the fourth in the fighting game series based on the popular anime, following Dragon Ball Z: Budokai Tenkaichi 3 released in 2007 for the PS2 and Wii.\n\nA new teaser t…",
      "url": "https://www.eurogamer.net/new-dragon-ball-z-budokai-tenkaichi-announced",
      "urlToImage": "https://assets.reedpopcdn.com/dragon-ball-z-budokai-tenkaichi-4.jpg/BROK/thumbnail/1200x630/dragon-ball-z-budokai-tenkaichi-4.jpg",
      "publishedAt": "2023-03-06T11:18:53Z",
      "content": "A new Dragon Ball Z: Budokai Tenkaichi game has been announced by Bandai Namco.\r\nThis will be the fourth in the fighting game series based on the popular anime, following Dragon Ball Z: Budokai Tenka… [+712 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Deadline"
      },
      "author": "Max Goldbart",
      "title": "Netflix To Boost APAC Content Investment By 15% In 2023 – Report",
      "description": "Netflix will splash the cash in the APAC region this year, boosting content investment by 15% as revenues grow by 12%, according to a report from Media Partners Asia (MPA). The forecast content spend of $1.9B will comprise almost half of the streamer’s predic…",
      "url": "https://deadline.com/2023/03/netflix-to-boost-apac-content-investment-by-15-in-2023-squid-game-1235280238/",
      "urlToImage": "https://deadline.com/wp-content/uploads/2022/08/Lee-Jung-jae-01-1.jpg?w=1024",
      "publishedAt": "2023-03-06T09:39:45Z",
      "content": "Netflix will splash the cash in the APAC region this year, boosting content investment by 15% as revenues grow by 12%, according to a report from Media Partners Asia (MPA).\r\nThe forecast content spen… [+1722 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "GQ Magazine"
      },
      "author": "The Editors of GQ",
      "title": "How to Join GQ3",
      "description": "Here’s everything you need to know about how to get in on GQ’s first Web3 drop.",
      "url": "https://www.gq.com/story/how-to-buy-a-gq-nft",
      "urlToImage": "https://media.gq.com/photos/640617a3fa9a5c56e8015bc8/16:9/w_1280,c_limit/gq3announce3.jpg",
      "publishedAt": "2023-03-06T17:24:36Z",
      "content": "By now youve probably heard that GQ is dropping its first-ever digital art NFTs. With 1,661 tokens, the GQ3 Issue 001: Change Is Good collection is offering unprecedented access to the GQ universe wi… [+2650 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Forbes"
      },
      "author": "Erik Kain, Senior Contributor, \n Erik Kain, Senior Contributor\n https://www.forbes.com/sites/erikkain/",
      "title": "The First ‘Fortnite’ Chapter 4, Season 2 Teasers Have Leaked Online",
      "description": "A Japanese-themed season called MEGA is on the way featuring Neo Tokyo, Attack on Titan and much more.",
      "url": "https://www.forbes.com/sites/erikkain/2023/03/06/the-first-fortnite-chapter-4-season-2-teasers-have-leaked-online/",
      "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/64060aaad54d78e73c25191c/0x0.jpg?format=jpg&width=1200",
      "publishedAt": "2023-03-06T15:55:07Z",
      "content": "Fortnite\r\nCredit: Epic Games\r\nThe current extended season of Fortnite is about to end, with Chapter 4, Season 2 just around the corner. Leaks and rumors all point to a Japanese-themed season, with Ne… [+1284 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Writetodone.com"
      },
      "author": "Leo Babauta",
      "title": "31 Ways to Find Inspiration for Your Writing",
      "description": "You can’t wait for inspiration. You have to go after it with a club. – Jack London No matter how much you love writing, there will always be days when you need inspiration from one muse or another. In fact, I would argue that inspiration is not just a desirab…",
      "url": "https://writetodone.com/31-ways-to-find-inspiration-for-your-writing/",
      "urlToImage": "https://writetodone.com/wp-content/uploads/2016/03/Find-Inspiration-for-Your-Writing.png",
      "publishedAt": "2023-03-06T21:29:42Z",
      "content": "You cant wait for inspiration. You have to go after it with a club. – Jack London\r\nNo matter how much you love writing, there will always be days when you need inspiration from one muse or another.\r\n… [+11261 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Daily Beast"
      },
      "author": "Barry Levitt",
      "title": "Jonathan Majors Is on a Hot Streak (Literally). And He’s Only Getting Started.",
      "description": "Photo Illustration by Thomas Levinson/The Daily Beast/HBO/Disney/Searchlight/Warner Bros\r\nJonathan Majors has been quietly impressing for a while now, in such films as The Last Black Man in San Francisco and Da 5 Bloods, as well as a starring role in the TV s…",
      "url": "https://www.thedailybeast.com/obsessed/jonathan-majors-in-creed-iii-a-revelatory-performance-for-an-up-and-comer",
      "urlToImage": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1688,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1678060198/230305-jonathan-majors-tease_eftdll",
      "publishedAt": "2023-03-06T08:54:47Z",
      "content": "Jonathan Majors has been quietly impressing for a while now, in such films as The Last Black Man in San Francisco and Da 5 Bloods, as well as a starring role in the TV series Lovecraft Country. But m… [+9039 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Twistedsifter.com"
      },
      "author": "Matthew Gilligan",
      "title": "He Ordered Something His Stepsister Didn’t Want to Eat. Is He a Jerk?",
      "description": "He did nothing wrong...",
      "url": "https://twistedsifter.com/2023/03/he-ordered-something-his-stepsister-didnt-want-to-eat-is-he-a-jerk/",
      "urlToImage": "https://twistedsifter.com/wp-content/uploads/2023/02/BeFunky-collage-12-12.jpg",
      "publishedAt": "2023-03-06T11:25:26Z",
      "content": "I guess it makes some sort of sense, but people sure do get all worked up about food, don’t they?And this story from the “Am I the A**hole?” page on Reddit is yet another example of someone getting t… [+2220 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Crooksandliars.com"
      },
      "author": "Conover Kennard",
      "title": "Dildo Saleswoman Unmasked As Propagandist Behind Neo-Nazi Network",
      "description": "A Sacramento dildo saleswoman whose propaganda canonized white supremacist murderers as \"saints\" has been unmasked by Anti-fascist researchers. Dallas Erin Humber, 33, had been named as one of the leading propagandists behind the neo-Nazi Terrorgram Collectiv…",
      "url": "https://crooksandliars.com/2023/03/dildo-saleswoman-unmasked-propagandist",
      "urlToImage": "https://crooksandliars.com/files/primary_image/23/03/screenshot_2023-03-05_at_2.52.43_pm.png",
      "publishedAt": "2023-03-06T13:23:03Z",
      "content": "A Sacramento dildo saleswoman whose propaganda canonized white supremacist murderers as \"saints\" has been unmasked by Anti-fascist researchers. Dallas Erin Humber, 33, had been named as one of the le… [+3019 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Screen Rant"
      },
      "author": "Francesco Cacciatore",
      "title": "The Biggest Winners in Crunchyroll's 2023 Anime Awards",
      "description": "Cyberpunk: Edgerunners takes home the biggest prize at Crunchyroll’s 2023 Anime Awards, but the industry titans still dominate with multiple awards.",
      "url": "https://screenrant.com/crunchyroll-2023-anime-awards-winners/",
      "urlToImage": "https://static1.srcdn.com/wordpress/wp-content/uploads/2023/03/spy-family-demon-slayer-attack-on-titan-composite-image.jpg",
      "publishedAt": "2023-03-06T21:00:16Z",
      "content": "Crunchyroll's 2023 Anime Awards have concluded with a big live celebration in Tokyo. Fans had the opportunity to vote for their favorite series from a list of nominees selected by judges, and the res… [+2861 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Screen Rant"
      },
      "author": "Steven Blackburn",
      "title": "Tokyo Ghoul's Most Divisive Moment Returns in Creator's New Series",
      "description": "Choujin X chapter 34.4 from Sui Ishida is reviving a moment that he first created in the Tokyo Ghoul manga and then rewrote in Tokyo Ghoul √A.",
      "url": "https://screenrant.com/tokyo-ghoul-most-divisive-moment-returns-choujinx/",
      "urlToImage": "https://static1.srcdn.com/wordpress/wp-content/uploads/2023/01/choujin-x-s-raise-is-a-lot-like-supercompensation-from-tokyo-ghoul-2.jpg",
      "publishedAt": "2023-03-06T00:00:15Z",
      "content": "Warning: Spoilers for Choujin X chapter 34.4Mangaka Sui Ishida is repeating the controversial decisions he made with Ken Kaneki in both the Tokyo Ghoul manga and the original story he wrote for the a… [+3264 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Bleeding Cool News"
      },
      "author": "Tyler Roberts",
      "title": "Bandai Reveals Demon Slayer Ultimate Legends Figures Are Coming",
      "description": "A lot of eyes are on the hit anime series Demon Slayer: Kimetsu no Yaiba lately. Not only is the show getting a movie theater recap release, but new collectibles are arriving soon from McFarlane Toys. Those figures were definitely something else with 7\", 5\", …",
      "url": "https://bleedingcool.com/collectibles/bandai-reveals-demon-slayer-ultimate-legends-figures-are-coming/",
      "urlToImage": "https://bleedingcool.com/wp-content/uploads/2023/03/DS_PR_Hero2-1200x628.jpg",
      "publishedAt": "2023-03-06T16:22:09Z",
      "content": "Bring home the world of Demon Slayer as Bandai announces they are bringing iconic heroes from the anime to their Ultimate Legends 5 line \r\nA lot of eyes are on the hit anime series Demon Slayer: Kime… [+2272 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Bleeding Cool News"
      },
      "author": "Tyler Roberts",
      "title": "McFarlane Reveals The Flash Batmobile and More DC Comics Figures",
      "description": "McFarlane Toys Winter Showcase has ended, giving collectors a look at what is to come throughout 2023. Fans were able to see new figures for the hit anime series Demon Slayer as well as new deadly Spawn figures. However, some of the biggest news was the arriv…",
      "url": "https://bleedingcool.com/collectibles/mcfarlane-reveals-the-flash-batmobile-and-more-dc-comics-figures/",
      "urlToImage": "https://bleedingcool.com/wp-content/uploads/2023/03/McFarlane-DC-Multiverse-The-Flash-Movie-Batmobile-1200x628.jpg",
      "publishedAt": "2023-03-06T16:53:10Z",
      "content": "Prepare to clear some spec on your shelves as even more DC Comics action figures are on the way from McFarlane Toys and teasers are here\r\nMcFarlane Toys Winter Showcase has ended, giving collectors a… [+1893 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Bleeding Cool News"
      },
      "author": "Tyler Roberts",
      "title": "McFarlane Toys Travels Back In Time to Unleash Medieval Spawn Figure",
      "description": "McFarlane Toys has been on a roll lately as they finish off their Winter Showcase, giving fans a look at what is on the horizon. We have seen the arrival of new Demon Slayer collectibles for anime fans, and statues for The Flash, and there was plenty of love …",
      "url": "https://bleedingcool.com/collectibles/mcfarlane-toys-travels-back-in-time-to-unleash-medieval-spawn-figure/",
      "urlToImage": "https://bleedingcool.com/wp-content/uploads/2023/03/Spawn-Medieval-08-1200x628.jpg",
      "publishedAt": "2023-03-06T14:22:11Z",
      "content": "McFarlane Toys is bringing more of Spawn Universe to life as a new action figure is arriving from Medieval Time with a new hero\r\nMcFarlane Toys has been on a roll lately as they finish off their Wint… [+1718 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Bleeding Cool News"
      },
      "author": "Gavin Sheehan",
      "title": "Puzzle & Dragons Launches JoJo's Bizarre Adventure Collaboration",
      "description": "GungHo Online Entertainment has launched a brand new collaboration for Puzzle & Dragons as JoJo's Bizarre Adventure arrives with some gusto. Starting today and running all the way until March 19th, you'll have a chance to participate in special events featuri…",
      "url": "https://bleedingcool.com/games/puzzle-dragons-launches-jojos-bizarre-adventure-collaboration/",
      "urlToImage": "https://bleedingcool.com/wp-content/uploads/2023/03/Puzzle-and-Dragons-JoJo-March-2023-1200x628.jpg",
      "publishedAt": "2023-03-06T19:12:09Z",
      "content": "Puzzle &amp; Dragons has an all-new collaboration happening right now featuring the characters of JoJos Bizarre Adventure!\r\nGungHo Online Entertainment has launched a brand new collaboration for Puzz… [+3105 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Bleeding Cool News"
      },
      "author": "Theo Dwyer",
      "title": "Dragon Ball Super Previews Power Absorbed: SSB Gogeta & Frieza",
      "description": "Bandai has announced the initial details of the first Dragon Ball Super Card Game set to release in 2023. This expansion will be the third in the Zenkai Series, the set block which kicked off in September 2022 which saw the introduction of Z-Cards as well as …",
      "url": "https://bleedingcool.com/games/dragon-ball-super-previews-power-absorbed-ssb-gogeta-frieza/",
      "urlToImage": "https://bleedingcool.com/wp-content/uploads/2023/03/EitJnbZXkAAvp2T-1-copy-120-1200x628.jpg",
      "publishedAt": "2023-03-06T18:12:11Z",
      "content": "Dragon Ball Super Card Game's next release, the Power Absorbed expansion, features Super Saiyan Blue Gogeta &amp; Frieza.\r\nBandai has announced the initial details of the first Dragon Ball Super Card… [+2054 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Bleeding Cool News"
      },
      "author": "Rich Johnston",
      "title": "45 Shots Of Cosplay From The London Comic Con Spring 2023",
      "description": "This weekend saw the London Comic Con Spring 2023 show at London Olympia. This isn't one of their big Summer Of Winter London Film And Comic Con shows, it's smaller, more intimate, on one floor of one of the halls only, but it is packed full of love as ever. …",
      "url": "https://bleedingcool.com/comics/45-shots-of-cosplay-from-the-london-comic-con-spring-2023/",
      "urlToImage": "https://bleedingcool.com/wp-content/uploads/2023/03/356D63D2-C94B-49EB-A218-7CF74FB40EA9-1200x628.jpeg",
      "publishedAt": "2023-03-06T13:57:11Z",
      "content": "Cosplayers took to the aisles, corridors, nooks and crannies of the London Comic Con Spring 2023 show, as well as the masquerade exhibition event.\r\nThis weekend saw the London Comic Con Spring 2023 s… [+1825 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Bleeding Cool News"
      },
      "author": "Rich Johnston",
      "title": "When an IDW Doctor Who Comic Had To Cut And Paste David Tennant",
      "description": "At the London Comic Con Spring 2023 held by Showmasters at London Olympia over the weekend, the Characters In Media panel saw Tony Lee, JL Straw, Lee Bradley and Stephen Baskerville talking about moving characters from one medium to another. Licensing issues …",
      "url": "https://bleedingcool.com/comics/when-an-idw-doctor-who-comic-had-to-cut-and-paste-david-tennant/",
      "urlToImage": "https://bleedingcool.com/wp-content/uploads/2023/03/Screenshot-2023-03-06-133637-1200x628.jpg",
      "publishedAt": "2023-03-06T14:58:09Z",
      "content": "At the London Comic Con Spring 2023, Tony Lee to talk about problems with the BBC with one of the first IDW issues of the Doctor Who comic book from 2009.\r\nAt the London Comic Con Spring 2023 held by… [+2286 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Bleeding Cool News"
      },
      "author": "Ray Flook",
      "title": "Rick and Morty: The Dirty Half-Dozen – 6 Seasons, 6 Key Episodes",
      "description": "If you've been following our coverage of Dan Harmon & Justin Roiland's Rick and Morty lately (at least when it comes to what's on Adult Swim screens), then you know that we've been doing some deep-diving into what Evil Morty & Rick Prime could mean to our dim…",
      "url": "https://bleedingcool.com/tv/rick-and-morty-the-dirty-half-dozen-6-seasons-6-key-episodes/",
      "urlToImage": "https://bleedingcool.com/wp-content/uploads/2023/03/Total_Rickall_cap-1200x628.jpg",
      "publishedAt": "2023-03-06T00:14:12Z",
      "content": "Six seasons. Six Episodes. One episode per season. Here are six key episodes from Adult Swim, Dan Harmon &amp; Justin Roiland's Rick and Morty.\r\nIf you've been following our coverage of Dan Harmon &a… [+4466 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Bleeding Cool News"
      },
      "author": "Rich Johnston",
      "title": "Astrobots Launch from WhatNot Delayed Until May",
      "description": "Simon Furman appeared at the London Comic Con Spring 2023 this weekend alongside his co-creator of Transformers, Death's Head, Dragon's Claws and To The Death, Geoff Senior. Simon Furman also had his new comic book series to show off, an adaptation of the Ast…",
      "url": "https://bleedingcool.com/comics/astro-bots-launch-from-whatnot-delayed-until-may/",
      "urlToImage": "https://bleedingcool.com/wp-content/uploads/2023/03/STL259389-1200x628.jpg",
      "publishedAt": "2023-03-06T21:57:10Z",
      "content": "Simon Furman appeared at the London Comic Con Spring 2023 this weekend with an adaptation of the Astro Bots line published by WhatNot Publishing.\r\nSimon Furman appeared at the London Comic Con Spring… [+4597 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Techviral.net"
      },
      "author": "Amarnath Chakraborty",
      "title": "Best ETTV Proxy / Mirror & Alternatives (Latest)",
      "description": "Two things help you relax after a hectic day: Music and Movies. Music can help you relax your mind and help you fall asleep faster, whereas Movie watching can provide entertainment that would help you forget all your worries. These days, it isn’t difficult to…",
      "url": "https://techviral.net/ettv-alternatives/",
      "urlToImage": "https://techviral.net/wp-content/uploads/2023/03/ETTV-Proxy.jpg",
      "publishedAt": "2023-03-06T17:16:37Z",
      "content": "Two things help you relax after a hectic day: Music and Movies. Music can help you relax your mind and help you fall asleep faster, whereas Movie watching can provide entertainment that would help yo… [+8602 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Siliconera"
      },
      "author": "Josh Tolentino",
      "title": "Rent-a-Girlfriend Season 3 Teaser Introduces Mini Yaemori",
      "description": "DMM Pictures released a new look at Rent-a-Girlfriend season 3. The third teaser for the ongoing anime series also introduces a new character named Mini Yaemori.\nCheck out the teaser below.\nhttps://www.youtube.com/watch?v=-jZWHwztqlk\nThe Rent-a-Girlfriend Sea…",
      "url": "https://www.siliconera.com/rent-a-girlfriend-season-3-teaser-introduces-mini-yaemori/",
      "urlToImage": "https://www.siliconera.com/wp-content/uploads/2023/03/rent-a-girlfriend-season-3.jpg",
      "publishedAt": "2023-03-06T14:30:19Z",
      "content": "DMM Pictures released a new look at Rent-a-Girlfriend season 3. The third teaser for the ongoing anime series also introduces a new character named Mini Yaemori.\r\nCheck out the teaser below.\r\nThe Ren… [+1636 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Siliconera"
      },
      "author": "Jenni Lada",
      "title": "Hololive EN’s Calliope Mori Makes Her Hologra Debut",
      "description": "Yet another member of Hololive English Myth appeared on the Holo no Graffiti (Hologra) “anime” web series. This time, Calliope Mori made her debut. Now that all five members of the group have their English models, they’ve been gradually making appearances in …",
      "url": "https://www.siliconera.com/hololive-ens-calliope-mori-makes-her-hologra-debut/",
      "urlToImage": "https://www.siliconera.com/wp-content/uploads/2023/03/screen-shot-2023-03-06-at-104637-am.png",
      "publishedAt": "2023-03-06T18:00:49Z",
      "content": "Yet another member of Hololive English Myth appeared on the Holo no Graffiti (Hologra) anime web series. This time, Calliope Mori made her debut. Now that all five members of the group have their Eng… [+1173 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Siliconera"
      },
      "author": "Jenni Lada",
      "title": "One Piece Three Sword Style Nami Figure Comes in Two Versions",
      "description": "Back in 2021, Eiichiro Oda drew a “Three Sword Style” Nami for the cover of One Piece Magazine Volume 13. She was essentially “stealing” Roronoa Zoro’s style for the pose. Now in December 2023, two figures inspired by the “dream scenario” design will be relea…",
      "url": "https://www.siliconera.com/one-piece-three-sword-style-nami-figure-comes-in-two-versions/",
      "urlToImage": "https://www.siliconera.com/wp-content/uploads/2023/03/screen-shot-2023-03-06-at-95717-am.png",
      "publishedAt": "2023-03-06T17:00:29Z",
      "content": "Back in 2021, Eiichiro Oda drew a Three Sword Style Nami for the cover of One Piece Magazine Volume 13. She was essentially stealing Roronoa Zoros style for the pose. Now in December 2023, two figure… [+1156 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Vulture"
      },
      "author": "Bilge Ebiri, Brandon Streussnig",
      "title": "The Stunt Awards",
      "description": "Vulture’s inaugural celebration of stunt professionals is here. The 2023 Stunt Awards celebrate the best action scenes in Top Gun: Maverick, Bullet Train, The Batman, Accident Man: Hitman’s Holiday, and more.",
      "url": "http://www.vulture.com/2023/03/vulture-stunt-awards-best-action-scenes-of-2023.html",
      "urlToImage": "https://pyxis.nymag.com/v1/imgs/108/283/869496ad963204b12ab3575df00671ae08-stunts.1x.rsocial.w1200.gif",
      "publishedAt": "2023-03-06T13:00:57Z",
      "content": "We sometimes talk about stunts as if they are distinct entities from the movies around them a single, spectacular moment that makes us go Wow. Tom Cruise is free-climbing a cliff! Jackie Chan is dang… [+34084 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Gizmodo Australia"
      },
      "author": "Andrew Liszewski",
      "title": "Help Convince Me to Buy This $US1,500 ($2,082) 3D Printer For Chocolate",
      "description": "It’s unfortunately arriving a little too late to woo whoever was your Valentine this year, but next month, you’ll be...\nThe post Help Convince Me to Buy This $US1,500 ($2,082) 3D Printer For Chocolate appeared first on Gizmodo Australia.\n  Related Stories\r\n<u…",
      "url": "https://www.gizmodo.com.au/2023/03/help-convince-me-to-buy-this-us1500-2082-3d-printer-for-chocolate/",
      "urlToImage": "https://www.gizmodo.com.au/wp-content/uploads/sites/2/2023/03/07/baf3a3b8101edcb4f5c392648bcb73df.jpg?quality=80&resize=1280,720",
      "publishedAt": "2023-03-06T22:50:00Z",
      "content": "Its unfortunately arriving a little too late to woo whoever was your Valentine this year, but next month, youll be able to pre-order a 3D printer that swaps melted plastic for melted chocolate, allow… [+2544 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Gizmodo Australia"
      },
      "author": "Rob Bricken",
      "title": "10 MCU Characters Whose Futures Are Inscrutable",
      "description": "It takes a lot of planning to build a comprehensive, stable cinematic universe. Marvel Studios’ ability to methodically introduce characters...\nThe post 10 MCU Characters Whose Futures Are Inscrutable appeared first on Gizmodo Australia.\n  Related Stories\r\n<u…",
      "url": "https://www.gizmodo.com.au/2023/03/10-mcu-characters-whose-futures-are-inscrutable/",
      "urlToImage": "https://www.gizmodo.com.au/wp-content/uploads/sites/2/2023/03/04/8306a1a5d5e2b2ed618ab648a76eeabf.png?quality=80&resize=1280,720",
      "publishedAt": "2023-03-06T00:45:00Z",
      "content": "It takes a lot of planning to build a comprehensive, stable cinematic universe. Marvel Studios ability to methodically introduce characters and future plot points has turned its movies into a reliabl… [+7685 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Gizmodo Australia"
      },
      "author": "Nicole Gillespie, Caitlin Curtis, Javad Pool, Steven Lockey",
      "title": "Would You Trust ChatGPT at Your Job?",
      "description": "Artificial intelligence (AI) tools are increasingly used at work to enhance productivity, improve decision making and reduce costs, including automating...\nThe post Would You Trust ChatGPT at Your Job? appeared first on Gizmodo Australia.\n\n  Related Stories\r\n…",
      "url": "https://www.gizmodo.com.au/2023/03/would-you-trust-chatgpt-at-your-job/",
      "urlToImage": "https://www.gizmodo.com.au/wp-content/uploads/sites/2/2023/03/06/f223877d7e9ab5daafdfa798f2be1926.jpg?quality=80&resize=1280,720",
      "publishedAt": "2023-03-06T11:00:00Z",
      "content": "Artificial intelligence (AI) tools are increasingly used at work to enhance productivity, improve decision making and reduce costs, including automating administrative tasks and monitoring security.\r… [+5463 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Gizmodo Australia"
      },
      "author": "James Whitbrook",
      "title": "Gundam: Witch From Mercury’s Season 2 Premieres Next Month",
      "description": "It’s only been a couple of months since Mobile Suit Gundam: The Witch From Mercury was off our screens, but...\nThe post Gundam: Witch From Mercury’s Season 2 Premieres Next Month appeared first on Gizmodo Australia.\n\n  Related Stories\r\n<ul><li>Joker 2 Set Pic…",
      "url": "https://www.gizmodo.com.au/2023/03/gundam-witch-from-mercurys-season-2-premieres-next-month/",
      "urlToImage": "https://www.gizmodo.com.au/wp-content/uploads/sites/2/2023/03/07/8220c8ede4cc76dfbea2205c938a7079.png?quality=80&resize=1280,720",
      "publishedAt": "2023-03-06T16:20:00Z",
      "content": "Its only been a couple of months since Mobile Suit Gundam: The Witch From Mercury was off our screens, but one of the best anime of 2022 is already ready to come back for more and real soon.\r\nOver th… [+1683 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "menshealth.com"
      },
      "author": "Joshua St. Clair",
      "title": "Troy Baker, the Voice of Joel in The Last of Us Game, Makes a Surprise Appearance in Episode 8",
      "description": "Recognize that voice? Video game fans should.",
      "url": "https://www.menshealth.com/entertainment/a43165480/the-last-of-us-troy-baker-cameo/",
      "urlToImage": "https://hips.hearstapps.com/hmg-prod/images/mh-3-3-split-64020e9895f0e.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*",
      "publishedAt": "2023-03-06T02:45:00Z",
      "content": "When \r\nThe Last of Usvoice actor Troy Baker learned of HBOs decision to cast Pedro Pascal as the live action version of his beloved bearded Joel, Baker tweeted three lines: F*ck. Yes. / Cannot wait t… [+2931 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Livejournal.com"
      },
      "author": "treats",
      "title": "Attack on Titan: Final Chapters Special 1 got released",
      "description": "The first of the two Attack on Titan specials got released on March 3rd and broke anime twitter. The final chapters cover the Rumbling and the Alliance's decision on how to handle it. \nThe show first aired in 2013 and the final chapter will be broadcasted in …",
      "url": "https://ohnotheydidnt.livejournal.com/125442523.html",
      "urlToImage": "https://l-files.livejournal.net/og_image/3616053/490009?v=1678110203",
      "publishedAt": "2023-03-06T13:43:06Z",
      "content": "The first of the two Attack on Titan specials got released on March 3rd and broke anime twitter. The final chapters cover the Rumbling and the Alliance's decision on how to handle it. \r\nThe show firs… [+157 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Japan Today"
      },
      "author": null,
      "title": "Netflix making live-action 'One Piece' from popular manga",
      "description": "Hit Japanese manga “One Piece” is coming to Netflix as a live-action series — a development that's both exciting and worrisome for fans who have seen mixed success in a growing list of Hollywood adaptations. Chronicling the coming-of-age adventures of Monkey …",
      "url": "https://japantoday.com/category/entertainment/netflix-making-live-action-%27one-piece%27-from-popular-manga",
      "urlToImage": null,
      "publishedAt": "2023-03-06T20:23:05Z",
      "content": "Hit Japanese manga One Piece is coming to Netflix as a live-action series a development that's both exciting and worrisome for fans who have seen mixed success in a growing list of Hollywood adaptati… [+4262 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Crunchyroll News"
      },
      "author": "Daryl Harding",
      "title": "One-Punch Man Manga Illustrator Yusuke Murata Releases First Part of Original Anime Zaiyuki",
      "description": "The first part was released on his Twitter accountLess than two weeks ago we got our first look at Yusuke Murata's first-ever original anime project Zaiyuki with his in-house anime studio Village Studio but today in a surprise drop, Murata released the \"A Par…",
      "url": "https://www.crunchyroll.com/anime-news/2023/03/06-1/one-punch-man-manga-illustrator-yusuke-murata-releases-first-part-of-original-anime-zaiyuki",
      "urlToImage": "https://img1.ak.crunchyroll.com/i/spire3/2d2303e0b7eec10cd80e2f309f1f36411678092799_main.jpg",
      "publishedAt": "2023-03-06T08:53:56Z",
      "content": "Less than two weeks ago we got our first look at Yusuke Murata's first-ever original anime project Zaiyuki with his in-house anime studio Village Studio but today in a surprise drop, Murata released … [+1149 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Crunchyroll News"
      },
      "author": "Daryl Harding",
      "title": "Love Live! Sunshine!! Anime Splashes Down in Sunshine Aquarium Collab",
      "description": "See Live! with sea life from March 18The girls from Aquors are used to hanging around the Numazu Aquarium but this March the Love Live! Sunshine!! idols are headed to Ikebukuro to leave their mark on the Sunshine Aquarium this March. Each night from 6 PM, the…",
      "url": "https://www.crunchyroll.com/anime-news/2023/03/06-1/love-live-sunshine-anime-splashes-down-in-sunshine-aquarium-collab",
      "urlToImage": "https://img1.ak.crunchyroll.com/i/spire1/38b6fc9e5b678f13edb4e9b5cc43f1a61678106116_main.jpg",
      "publishedAt": "2023-03-06T12:35:36Z",
      "content": "The girls from Aquors are used to hanging around the Numazu Aquarium but this March the Love Live! Sunshine!! idols are headed to Ikebukuro to leave their mark on the Sunshine Aquarium this March. Ea… [+1299 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Crunchyroll News"
      },
      "author": "Daryl Harding",
      "title": "Toman Take Over Tokyo Tower in Tokyo Revengers Anime Collab",
      "description": "For one month, Tokyo Tower will be painted (more) redWhile Tokyo Manji Gang might be opening a fist full of presents in the Christmas Showdown Arc of the Tokyo Revengers TV anime right now, they’ve decided to take a detour this March to take over Tokyo Tower!…",
      "url": "https://www.crunchyroll.com/anime-news/2023/03/05-1/toman-take-over-tokyo-tower-in-tokyo-revengers-anime-collab",
      "urlToImage": "https://img1.ak.crunchyroll.com/i/spire1/23c4febef0a47197f256b1a6836fdbe81678087209_main.jpg",
      "publishedAt": "2023-03-06T07:20:20Z",
      "content": "Image via Tokyo Revengers on Twitter\r\nWhile Tokyo Manji Gang might be opening a fist full of presents in the Christmas Showdown Arc of the Tokyo Revengers TV anime right now, they’ve decided to take … [+1962 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Crunchyroll News"
      },
      "author": "Liam Dempsey",
      "title": "David and Lucy Take the Cyberpunk 2077 x Secretlab Chair for a Spin in Official Illustration",
      "description": "Drawn by Cyberpunk: Edgerunners character designerFirst released in 2020, the Cyberpunk 2077 x Secretlab gaming chair jacked into the world of the Cyberpunk: Edgerunners anime series through a brand-new official illustration by character designer Yoh Yoshinar…",
      "url": "https://www.crunchyroll.com/anime-news/2023/03/06-1/david-and-lucy-take-the-cyberpunk-2077-x-secretlab-chair-for-a-spin-in-official-illustration",
      "urlToImage": "https://img1.ak.crunchyroll.com/i/spire3/361b2744a0181ccc8711ef958f25fb6c1678094922_main.jpg",
      "publishedAt": "2023-03-06T09:32:28Z",
      "content": "Image via Cyberpunk: Edgerunners website\r\nIt must've been an exhausting night of celebrations after Cyberpunk: Edgerunners took home Anime of the Year and Best Voice Acting Performance (English) at t… [+1375 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Crunchyroll News"
      },
      "author": "Daryl Harding",
      "title": "THE FIRST SLAM DUNK Anime Film Travels Past Your Name to Be the Top Japanese Movie in South Korea of All Time",
      "description": "And the score continues to increase for the basketball film!While it has been no secret that THE FIRST SLAM DUNK anime film has by far exceeded expectations in its home country of Japan, just over the sea in South Korea, the flick has scored a record-breaking…",
      "url": "https://www.crunchyroll.com/anime-news/2023/03/05-1/the-first-slam-dunk-anime-film-travels-past-your-name-to-be-the-top-japanese-movie-in-south-korea-of-all-time",
      "urlToImage": "https://img1.ak.crunchyroll.com/i/spire3/39b5ed56cc4392f5cc3d51ec19bbe79e1678071274_main.jpg",
      "publishedAt": "2023-03-06T02:54:43Z",
      "content": "While it has been no secret that THE FIRST SLAM DUNK anime film has by far exceeded expectations in its home country of Japan, becoming the 12th highest-grossing anime film of all time as of last Sun… [+1998 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Crunchyroll News"
      },
      "author": "Liam Dempsey",
      "title": "Summoned to Another World… Again?! TV Anime Unveils New Visual, Trailer",
      "description": "Fantasy series premieres on April 8Once comrades, now enemies, Setsu and Touma cross swords in an epic key visual for the Summoned to Another World… Again?! anime. A full trailer highlighting the bond and betrayal between them was also released, so hit the ju…",
      "url": "https://www.crunchyroll.com/anime-news/2023/03/05-1/summoned-to-another-world-again-tv-anime-unveils-new-visual-trailer",
      "urlToImage": "https://img1.ak.crunchyroll.com/i/spire4/162bde3454e4a181dc9a1fd8d1cf133f1678076310_main.jpg",
      "publishedAt": "2023-03-06T04:21:54Z",
      "content": "Following February's big update on the series that included the premiere date and more, it's time to learn more about the Summoned to Another World… Again?! anime…again! A second key visual and full … [+1412 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Crunchyroll News"
      },
      "author": "Mikikazu Komatsu",
      "title": "Aya Uchida to Release Chronicles of an Aristocrat Reborn in Another World Opening Theme on May 24",
      "description": "She is also cast as one of the anime's main characters, Silk von SantanaJapanese record company Nippon Columbia has announced that voice actress Aya Uchida's (Kotori Minami in Love Live!) much-awaited seventh single \"Preview\" is set to be released on May 24, …",
      "url": "https://www.crunchyroll.com/anime-news/2023/03/05/aya-uchida-to-release-chronicles-of-an-aristocrat-reborn-in-another-world-opening-theme-on-may-24",
      "urlToImage": "https://img1.ak.crunchyroll.com/i/spire4/4220842edebb027d1b132bcefc1afd701678068344_main.jpg",
      "publishedAt": "2023-03-06T02:10:03Z",
      "content": "Japanese record company Nippon Columbia has announced that voice actress Aya Uchida's (Kotori Minami in Love Live!)'s much-awaited seventh single \"Preview\" is set to be released on May 24, 2023. It w… [+1274 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Crunchyroll News"
      },
      "author": "Kara Dennison",
      "title": "Add Gundam Flair to Your Wardrobe With New COSPA Casual Apparel",
      "description": "Tees, jeans and wallets are emblazoned with the logo of the Earth Federation or ZeonYou don't have to go full cosplay to show your Gundam love! A new line of Mobile Suit Gundam inspired goods from COSPA adds the emblems of the Earth Federation and Zeon to com…",
      "url": "https://www.crunchyroll.com/anime-news/2023/03/06/add-gundam-flair-to-your-wardrobe-with-new-cospa-casual-apparel",
      "urlToImage": "https://img1.ak.crunchyroll.com/i/spire2/6a6d7a3f06b2f667e29f626b77849e991678110716_main.png",
      "publishedAt": "2023-03-06T14:21:24Z",
      "content": "You don't have to go full cosplay to show your Gundam love!\r\nA new line of Mobile Suit Gundam inspired goods from COSPA adds the emblems of the Earth Federation and Zeon to comfy casual items you can… [+979 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Crunchyroll News"
      },
      "author": "Mikikazu Komatsu",
      "title": "Gundam Singer Hiroko Moriguchi to Release New Anisong Cover Album in May",
      "description": "Former Megadeth guitarist Marty Friedman joins the recordingAnisong singer Hiroko Moriguchi, best known for her works for the Gundam theme songs since the mid-1980s, has announced that she will release a new album \"ANISON COVERS\" on May 24, based on the conce…",
      "url": "https://www.crunchyroll.com/anime-news/2023/03/05-1/gundam-singer-hiroko-moriguchi-to-release-new-anisong-cover-album-in-may",
      "urlToImage": "https://img1.ak.crunchyroll.com/i/spire3/4f787e3da3ebbdead9212faabaa0a0e21678079660_main.jpg",
      "publishedAt": "2023-03-06T05:20:11Z",
      "content": "Anisong singer Hiroko Moriguchi, best known for her works for the Gundam theme songs since the mid-1980s, has announced that she will release a new album \"ANISON COVERS\" on May 24, based on the conce… [+2940 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Crunchyroll News"
      },
      "author": "Daryl Harding",
      "title": "Suzume Anime Film Passes 14 Billion Yen as It Travels Up Japan’s All Time Box Office",
      "description": "The Makoto Shinkai film opens worldwide in AprilWhile being one of the highest-grossing films of all time in Japan has its limits in how many records are left to break, over the last week Makoto Shinkai’s Suzume still reached another milestone. Read on for mo…",
      "url": "https://www.crunchyroll.com/anime-news/2023/03/06/suzume-anime-film-passes-14-billion-yen-as-it-travels-up-japans-all-time-box-office",
      "urlToImage": "https://img1.ak.crunchyroll.com/i/spire4/6976f6690f74a5445b473205e20e851e1678122528_main.jpg",
      "publishedAt": "2023-03-06T17:13:25Z",
      "content": "While being one of the highest-grossing films of all time in Japan has its limits in how many records are left to break, over the last week Makoto Shinkai’s Suzume anime film still reached another mi… [+2718 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Crunchyroll News"
      },
      "author": "Daryl Harding",
      "title": "Demon Slayer -To the Swordsmith Village- Journeys Past 3.5 Billion Yen in Japan",
      "description": "The feature-length cut opened internationally on March 3Now that Demon Slayer: Kimetsu no Yaiba -To the Swordsmith Village- has opened internationally, fans across the world can get that taste of the new TV anime season. In Japan, fans continue to flock to th…",
      "url": "https://www.crunchyroll.com/anime-news/2023/03/06/demon-slayer-to-the-swordsmith-village-journeys-past-35-billion-yen-in-japan",
      "urlToImage": "https://img1.ak.crunchyroll.com/i/spire2/b4450d4a7f6f3ccf72a20d97a7c0303d1678122779_main.jpg",
      "publishedAt": "2023-03-06T17:16:54Z",
      "content": "Now that Demon Slayer: Kimetsu no Yaiba -To the Swordsmith Village- has opened internationally, fans across the world can get that taste of the new TV anime season before it premieres on April 9. In … [+2038 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Crunchyroll News"
      },
      "author": "Humberto Saabedra",
      "title": "IDOLiSH7 LIVE 4bit BEYOND THE PERiOD Anime Film Gets 2 Versions With Different Songlists",
      "description": "The different versions will screen on consecutive days in JapanFollowing up on the January announcement of the forthcoming IDOLISH7 feature film IDOLiSH7 LIVE 4bit BEYOND THE PERiOD, more details on the film have been released. Read on for the details.",
      "url": "https://www.crunchyroll.com/anime-news/2023/03/06/idolish7-live-4bit-beyond-the-period-anime-film-gets-2-versions-with-different-songlists",
      "urlToImage": "https://img1.ak.crunchyroll.com/i/spire1/0c11ee41a0f79044cda4c72dce9a285c1678143086_main.jpg",
      "publishedAt": "2023-03-06T23:11:37Z",
      "content": "Following up on the January announcement of the forthcoming IDOLIiSH7 feature film IDOLiSH7 LIVE 4bit BEYOND THE PERiOD, more details have been released. In keeping with the live performance nature o… [+2660 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Crunchyroll News"
      },
      "author": "Mikikazu Komatsu",
      "title": "Love Live! Superstar!! to Reveal New First-year Student Members on April 28",
      "description": "TV anime third season has been in the worksNew first-year student members who will join Liella!, the school idol unit in Love Live! Superstar!!, will be revealed in the June 2023 issue of KADOKAWA's LoveLive！Days magazine to be published in Japan on April 28,…",
      "url": "https://www.crunchyroll.com/anime-news/2023/03/05-1/love-live-superstar-to-reveal-new-first-year-student-members-on-april-28",
      "urlToImage": "https://img1.ak.crunchyroll.com/i/spire3/9fb1d17efd36a652f694bed69bf3eeef1678062835_main.jpg",
      "publishedAt": "2023-03-06T00:40:03Z",
      "content": "New first-year student members who will join Liella!, the school idol unit in Love Live! Superstar!!, will be revealed in the June 2023 issue of KADOKAWA's LoveLiveDays magazine to be published in Ja… [+1828 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Crunchyroll News"
      },
      "author": "Liam Dempsey",
      "title": "One Piece Freezes Over for First Ice Skating Show This Summer",
      "description": "Brrrrrr-illiant!One Piece has been on a hot streak lately with its latest smash-hit film, the unstoppable anime series and a brand-new video game, so the franchise is taking some time to cool off this summer with an ice skating show adaptation. Hit the jump f…",
      "url": "https://www.crunchyroll.com/anime-news/2023/03/05/one-piece-freezes-over-for-first-ice-skating-show-this-summer",
      "urlToImage": "https://img1.ak.crunchyroll.com/i/spire2/ea5fbf92c617aa8050006b5312f6e2b61678073561_main.png",
      "publishedAt": "2023-03-06T03:35:39Z",
      "content": "The grand One Piecejourney spans as many mediums as it does episodes and chapters, with a whole range of animation, comics, games and more to venture into. And now, an ice skating show scheduled for … [+816 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Crunchyroll News"
      },
      "author": "Paul Chapman",
      "title": "Jashin-chan from Dropkick on My Devil! Lends Her Talents to Text-to-Speech Software",
      "description": "VOICEPEAK Jashin-chan module allows fans to try out 5 different emotional statesFans who long to listen to the dulcet tones of a lamia now have a new avenue to explore, because AH Software has published a module for their VOICEPEAK text-to-voice software feat…",
      "url": "https://www.crunchyroll.com/anime-news/2023/03/06/jashin-chan-from-dropkick-on-my-devil-lends-her-talents-to-text-to-speech-software",
      "urlToImage": "https://img1.ak.crunchyroll.com/i/spire1/934b0a5bfd75b84301ace0746bf5a35c1678115007_main.jpg",
      "publishedAt": "2023-03-06T15:21:27Z",
      "content": "Fans who long to listen to the dulcet tones of a lamia now have a new avenue to explore, because AH Software has published a module for their VOICEPEAK text-to-voice software featuring Jashin-chan fr… [+1023 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Crunchyroll News"
      },
      "author": "Humberto Saabedra",
      "title": "Doraemon's Anywhere Door Gets Turned into Tribute Watch",
      "description": "Doraemon: Nobita's Sky Utopia anime film released on March 3 in JapanFollowing the release of the latest Doraemon feature film in Doraemon: Nobita's Sky Utopia, Japanese accessory maker and designer Eyeup has announced two tribute watches to celebrate the fil…",
      "url": "https://www.crunchyroll.com/anime-news/2023/03/06/doraemons-anywhere-door-gets-turned-into-tribute-watch",
      "urlToImage": "https://img1.ak.crunchyroll.com/i/spire3/dd44097c17a1514a7f547ec38299a9251678130881_main.jpg",
      "publishedAt": "2023-03-06T19:39:28Z",
      "content": "Following the release of the latest Doraemon feature film in Doraemon: Nobita's Sky Utopia, Japanese accessory maker and designer Eyeup has announced two tribute watches to celebrate the film's relea… [+776 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Crunchyroll News"
      },
      "author": "Joseph Luster",
      "title": "Demon Slayer: Kimetsu no Yaiba -To the Swordsmith Village- Anime Exceeds $10 Million in US Box Office",
      "description": "It was a big opening weekend for Tanjiro and the rest of the gangThis weekend saw the premiere of Demon Slayer: Kimetsu no Yaiba -To the Swordsmith Village- in U.S. theaters, and Tanjiro and the gang rocked the box office. Read on for more.",
      "url": "https://www.crunchyroll.com/anime-news/2023/03/06/demon-slayer-kimetsu-no-yaiba-to-the-swordsmith-village-anime-exceeds-10-million-in-us-box-office",
      "urlToImage": "https://img1.ak.crunchyroll.com/i/spire1/ed02f4c4cc0cec0c296cb75beddefa101678121078_main.png",
      "publishedAt": "2023-03-06T16:46:05Z",
      "content": "This weekend saw the premiere of Demon Slayer: Kimetsu no Yaiba -To the Swordsmith Village-in U.S. theaters, and Tanjiro and the gang rocked the box office. Following an opening on Friday, March 3 th… [+2171 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Crunchyroll News"
      },
      "author": "Mikikazu Komatsu",
      "title": "Peach Aviation to Operate Soaring Sky! Precure Wrapping Jet in Japanese Skies",
      "description": "Cure Sky VA Akira Sekine: \"The image of flying in the sky is very suitable for Soaring Sky Precure.\"This is a perfect collaboration! Japanese budget airline Peach Aviation has announced a collaboration campaign with Soaring Sky! Precure, including the operati…",
      "url": "https://www.crunchyroll.com/anime-news/2023/03/05/peach-aviation-to-operate-soaring-sky-precure-wrapping-jet-in-japanese-skies",
      "urlToImage": "https://img1.ak.crunchyroll.com/i/spire4/4b957b6f8482577217b5a302b28058811678076064_main.jpg",
      "publishedAt": "2023-03-06T04:20:55Z",
      "content": "This is a perfect collaboration! Japanese budget airline Peach Aviation announced a collaboration campaign with the ongoing 20th Precure TV anime series Soaring Sky! Precure, including the operation … [+1802 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Crunchyroll News"
      },
      "author": "Joseph Luster",
      "title": "Attack on Titan x Secretlab Collection Completed with Themed Desk Mat",
      "description": "Complete your desktop setup and add a nice complement to your TITAN Evo 2022 chairNow that Attack on Titan Final Season THE FINAL CHAPTERS Special 1 is upon us, Secretlab is celebrating with a special Desk Mat that completes its collection. Read on for more.",
      "url": "https://www.crunchyroll.com/anime-news/2023/03/06/attack-on-titan-x-secretlab-collection-completed-with-themed-desk-mat",
      "urlToImage": "https://img1.ak.crunchyroll.com/i/spire1/44063f3ebd51ddd3193d0d4233bf59931678114167_main.jpg",
      "publishedAt": "2023-03-06T16:00:00Z",
      "content": "Last February, Secretlab teamed up with Funimation to release the Secretlab TITAN Evo 2022 Attack on Titan Edition chair, giving fans a chance to game, work or just chill in a detailed Attack on Tita… [+1628 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Crunchyroll News"
      },
      "author": "Kara Dennison",
      "title": "Wave, Listen to Me! TV Drama Adds Three More Cast Members",
      "description": "Hiroaki Samura's manga comes to life on TV Asahi in AprilThe cast of Wave, Listen to Me! is growing! The live drama, due to premiere next month on TV Asahi, will bring to life Hiroaki Samura's manga about a waitress who lands herself a job as a radio talk sho…",
      "url": "https://www.crunchyroll.com/anime-news/2023/03/06/wave-listen-to-me-tv-drama-adds-three-more-cast-members",
      "urlToImage": "https://img1.ak.crunchyroll.com/i/spire2/6b637adf189ef701b7490cec6f17b3d91678109776_main.png",
      "publishedAt": "2023-03-06T13:48:23Z",
      "content": "Next month, TV Asahi will premiere Wave, Listen to Me!—a live-action drama based on Hiroaki Samura's manga of the same name. With a little over a month to go until Minare Koda makes her J-drama debut… [+1636 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Pockettactics.com"
      },
      "author": "Connor Christie",
      "title": "Obby Roblox games are making the obstacle course big again",
      "description": "If you haven’t heard of obby Roblox games, you might be missing out. This growing genre is all over Roblox at the minute, providing an alternative to the anime-inspired titles and children’s cartoons doubling as stalking murderers. Still, I bet you’re asking …",
      "url": "https://www.pockettactics.com/obby-roblox-games",
      "urlToImage": "https://www.pockettactics.com/wp-content/sites/pockettactics/2023/03/obby-roblox-games.jpg",
      "publishedAt": "2023-03-06T16:37:07Z",
      "content": "If you haven’t heard of obby Roblox games, you might be missing out. This growing genre is all over Roblox at the minute, providing an alternative to the anime-inspired titles and children’s cartoons… [+1710 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Pockettactics.com"
      },
      "author": "Kayleigh Partleton",
      "title": "Super Dunk codes",
      "description": "If you think of yourself as the next virtual Michael Jordan or LeBron James, you might want to give our Super Dunk codes guide a read, as it can give you a leg up when it comes to shooting hoops. In this guide, you can get pets, eggs, and power to give you th…",
      "url": "https://www.pockettactics.com/super-dunk/codes",
      "urlToImage": "https://www.pockettactics.com/wp-content/sites/pockettactics/2023/03/super-dunk-codes.jpg",
      "publishedAt": "2023-03-06T15:33:40Z",
      "content": "If you think of yourself as the next virtual Michael Jordan or LeBron James, you might want to give our Super Dunk codes guide a read, as it can give you a leg up when it comes to shooting hoops. In … [+1482 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Pockettactics.com"
      },
      "author": "Kayleigh Partleton",
      "title": "Fruit Warriors codes",
      "description": "If you love One Piece and want to know what it’s like to be a sea-faring scallywag, our Fruit Warriors codes guide is a great place to be. Here, you can get all manner of in-game goodies to help you as you explore a vast world. It’s full of treasure, enemies,…",
      "url": "https://www.pockettactics.com/fruit-warriors/codes",
      "urlToImage": "https://www.pockettactics.com/wp-content/sites/pockettactics/2023/03/fruit-warriors-codes.jpg",
      "publishedAt": "2023-03-06T12:12:51Z",
      "content": "If you love One Piece and want to know what it’s like to be a sea-faring scallywag, our Fruit Warriors codes guide is a great place to be. Here, you can get all manner of in-game goodies to help you … [+1466 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Pockettactics.com"
      },
      "author": "Tilly Lawton",
      "title": "Oni: Road to be the Mightiest Oni Switch review – the one and oni",
      "description": "I've long been fascinated with legends of oni and the tale of Momotaro, so upon seeing Oni: Road to be the Mightiest Oni and hearing of its unique take on Momotaro and his oni opponents, I knew I couldn't let a peach like this pass me by. And, ultimately, I'm…",
      "url": "https://www.pockettactics.com/oni-road-to-be-the-mightiest-oni/review",
      "urlToImage": "https://www.pockettactics.com/wp-content/sites/pockettactics/2023/03/oni-road-to-be-the-mightiest-oni-review-1.jpg",
      "publishedAt": "2023-03-06T15:09:13Z",
      "content": "I’ve long been fascinated with legends of oni and the tale of Momotaro, so upon seeing Oni: Road to be the Mightiest Oni and hearing of its unique take on Momotaro and his oni opponents, I knew I cou… [+13604 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "DroidGamers"
      },
      "author": "Meriel Green",
      "title": "Arcane Odyssey Bosses Guide",
      "description": "This article contains an Arcane Odyssey bosses guide, with details on the stats and drops from the various bosses in this Roblox ARPG.",
      "url": "https://www.droidgamers.com/guides/arcane-odyssey-bosses/",
      "urlToImage": "https://www.droidgamers.com/wp-content/uploads/2023/03/arcane-odyssey-bosses.jpg",
      "publishedAt": "2023-03-06T15:35:41Z",
      "content": "Want to know about some of the heavy hitters in the Arcane Odyssey universe? Well, we can help you out. Our Arcane Odyssey bosses guide has the info you need on the biggest and baddest that the wild … [+3138 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Anime News Network"
      },
      "author": null,
      "title": "Summoned to Another World... Again?! Anime Reveals 2nd Promo Video, Key Visual",
      "description": "Anime premieres on April 8 // The official website for the television anime of Kazuha Kishimoto's Isekai Shōkan wa Nidome Desu (Summoned to Another World......",
      "url": "https://www.animenewsnetwork.com/news/2023-03-06/summoned-to-another-world-again-anime-reveals-2nd-promo-video-key-visual/.195640",
      "urlToImage": "https://www.animenewsnetwork.com/thumbnails/crop600x315gUH/cms/news.6/195640/summon.jpg",
      "publishedAt": "2023-03-06T08:03:55Z",
      "content": "The official website for the television anime of Kazuha Kishimoto's Isekai Shkan wa Nidome Desu (Summoned to Another World... Again?!) light novel series revealed the anime's second promotional video… [+2015 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Anime News Network"
      },
      "author": null,
      "title": "Distribution Solutions to Distribute Sentai Filmworks/Section 23's Home Video Releases",
      "description": "Alliance Entertainment Corporation subsidiary begins handling distribution on April 3",
      "url": "https://www.animenewsnetwork.com/news/2023-03-06/distribution-solutions-to-distribute-sentai-filmworks-section-23-home-video-releases/.195661",
      "urlToImage": "https://www.animenewsnetwork.com/thumbnails/crop600x315g0D/cms/news.3/149593/sentai.png.jpg",
      "publishedAt": "2023-03-06T19:35:35Z",
      "content": "© Sentai Filmworks\r\nSentai Filmworks announced on Monday that Distribution Solutions (DS), a wholly owned subsidiary of Alliance Entertainment Corporation, will begin handling distribution of Blu-ray… [+1382 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Anime News Network"
      },
      "author": null,
      "title": "One Piece Manga Gets Its 1st Ice Show This Summer",
      "description": "The official website for Eiichiro Oda's One Piece manga announced on Monday that the manga is inspiring its first ever ice show, One Piece on Ice, this...",
      "url": "https://www.animenewsnetwork.com/daily-briefs/2023-03-05/one-piece-manga-gets-its-1st-ice-show-this-summer/.195637",
      "urlToImage": "https://www.animenewsnetwork.com/thumbnails/crop600x315gGF/cms/news.6/195637/onepieceonice.jpg",
      "publishedAt": "2023-03-06T03:33:12Z",
      "content": "The official website for Eiichiro Oda's One Piece manga announced on Monday that the manga is inspiring its first ever ice show, One Piece on Ice, this summer. The announcement did not reveal any fur… [+1183 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Anime News Network"
      },
      "author": null,
      "title": "Saudi Arabia's Public Investment Fund Increases Stake in Both Toei, Nintendo",
      "description": "PIF raises stake in Toei to 6.03%, in Nintendo to 8.26%",
      "url": "https://www.animenewsnetwork.com/news/2023-03-06/saudi-arabia-public-investment-fund-increases-stake-in-both-toei-nintendo/.195650",
      "urlToImage": "https://www.animenewsnetwork.com/thumbnails/crop600x315gO3/herald/stock/news/generic.png.jpg",
      "publishedAt": "2023-03-06T10:43:49Z",
      "content": "Reuters reported on Friday that the Kingdom of Saudi Arabia's Public Investment Fund (PIF), chaired by the kingdom's Crown Prince Mohammed bin Salman, has raised is stake in Toei Co., Ltd. from 5% to… [+1760 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Anime News Network"
      },
      "author": null,
      "title": "Bokura no Sennen to Kimi ga Shinu Made no 30-ka Kan Project's Stage Play, Film Reveals Cast, Debut Dates",
      "description": "September stage play, fall live-action film to feature same 3 main cast members",
      "url": "https://www.animenewsnetwork.com/news/2023-03-06/bokura-no-sennen-to-kimi-ga-shinu-made-no-30-ka-kan-project-stage-play-film-reveals-cast-debut-dates/.195636",
      "urlToImage": "https://www.animenewsnetwork.com/thumbnails/crop600x315gT5/cms/news.6/195636/stage-film.jpg",
      "publishedAt": "2023-03-06T06:08:24Z",
      "content": "The \"Bokura no Sennen Project\" the Bokura no Sennen to Kimi ga Shinu Made no 30-ka Kan (Our Millennium and the 30 Days Until You Die) multimedia project involving a manga, live-action film, and stage… [+1733 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "GamesRadar+"
      },
      "author": "Hope Bellingham",
      "title": "Cyberpunk: Edgerunners wins Anime of The Year award its fans couldn't be more proud",
      "description": "The Netflix series managed to beat Demon Slayer, Attack on Titan, and Spy x Family",
      "url": "https://www.gamesradar.com/cyberpunk-edgerunners-wins-anime-of-the-year-award-its-fans-couldnt-be-more-proud/",
      "urlToImage": "https://cdn.mos.cms.futurecdn.net/L5UDw9bAaCfVBvkFRWE94J-1200-80.jpg",
      "publishedAt": "2023-03-06T11:06:53Z",
      "content": "Cyberpunk: Edgerunners has been crowned Anime of the Year by The Anime Awards, and its fans couldn't be prouder. \r\nOver the weekend, anime streaming platform Crunchyroll hosted its annual The Anime A… [+2470 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "GamesRadar+"
      },
      "author": "Emily Garbutt",
      "title": "Michael B. Jordan's boxing gear in Creed 3 features an anime detail you may not have noticed",
      "description": "Did you spot the movie's nod to Akira?",
      "url": "https://www.gamesradar.com/creed-3-michael-b-jordan-anime-reference-akira/",
      "urlToImage": "https://cdn.mos.cms.futurecdn.net/5N9ZqBcMYkETTCDUaAncZL-1200-80.jpg",
      "publishedAt": "2023-03-06T14:56:02Z",
      "content": "Creed 3 includes a subtle anime reference that you may not have noticed. More specifically, one of Adonis Creed's boxing get-ups, which features a reference to the movie Akira.\r\nDesigner Raphael Phil… [+1860 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "GamesRadar+"
      },
      "author": "bradley.russell@futurenet.com (Bradley Russell)",
      "title": "Attack on Titan season 4, Final Chapters Special 2 release date: when is episode 89 airing?",
      "description": "Here's when the Attack on Titan series finale is projected to be released",
      "url": "https://www.gamesradar.com/attack-on-titan-season-4-final-chapters-special-2-release-date-episode-89/",
      "urlToImage": "https://cdn.mos.cms.futurecdn.net/yKUpEYSVh3mKegJukBeXCU-1200-80.jpg",
      "publishedAt": "2023-03-06T10:02:03Z",
      "content": "This is it. Attack on Titan is down to its very last episode. The Final Season – season 4 if you’re keeping count – has been split into three parts but we’re finally here. Episode 89 marks the defini… [+1751 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Gizmodo.com"
      },
      "author": "James Whitbrook",
      "title": "Gundam: Witch From Mercury's Season 2 Premieres Next Month",
      "description": "It’s only been a couple of months since Mobile Suit Gundam: The Witch From Mercury was off our screens, but one of the best anime of 2022 is already ready to come back for more—and real soon.Read more...",
      "url": "https://gizmodo.com/gundam-witch-from-mercury-season-2-release-date-stream-1850192475",
      "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/8220c8ede4cc76dfbea2205c938a7079.png",
      "publishedAt": "2023-03-06T16:20:00Z",
      "content": "Its only been a couple of months since Mobile Suit Gundam: The Witch From Mercury was off our screens, but one of the best anime of 2022 is already ready to come back for moreand real soon.\r\nOver the… [+1402 chars]"
    },
    {
      "source": {
        "id": "google-news",
        "name": "Google News"
      },
      "author": null,
      "title": "Distribution Solutions to Distribute Sentai Filmworks/Section 23's Home Video Releases - Anime News Network",
      "description": "Distribution Solutions to Distribute Sentai Filmworks/Section 23's Home Video Releases  Anime News Network",
      "url": "https://consent.google.com/ml?continue=https://news.google.com/rss/articles/CBMijQFodHRwczovL3d3dy5hbmltZW5ld3NuZXR3b3JrLmNvbS9uZXdzLzIwMjMtMDMtMDYvZGlzdHJpYnV0aW9uLXNvbHV0aW9ucy10by1kaXN0cmlidXRlLXNlbnRhaS1maWxtd29ya3Mtc2VjdGlvbi0yMy1ob21lLXZpZGVvLXJlbGVhc2VzLy4xOTU2NjHSAQA?oc%3D5&gl=FR&hl=en-US&pc=n&src=1",
      "urlToImage": null,
      "publishedAt": "2023-03-06T19:35:35Z",
      "content": "We use cookies and data to<ul><li>Deliver and maintain Google services</li><li>Track outages and protect against spam, fraud, and abuse</li><li>Measure audience engagement and site statistics to unde… [+1131 chars]"
    },
    {
      "source": {
        "id": "fortune",
        "name": "Fortune"
      },
      "author": "Yuri Kageyama, The Associated Press",
      "title": "World's bestselling manga series is getting the Netflix live-action treatment",
      "description": "Live-action “One Piece,” expected later this year, comes on the heels of the global success of “Demon Slayer”.",
      "url": "https://fortune.com/2023/03/06/one-piece-live-action-series-netflix/",
      "urlToImage": "https://content.fortune.com/wp-content/uploads/2023/03/GettyImages-1436636091-e1678100803249.jpg?resize=1200,600",
      "publishedAt": "2023-03-06T11:08:05Z",
      "content": "Hit Japanese manga One Piece is coming to Netflix as a live-action series a development thats both exciting and worrisome for fans who have seen mixed success in a growing list of Hollywood adaptatio… [+4255 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Winter is Coming"
      },
      "author": "Anwesha Nag",
      "title": "When will Attack on Titan return for its final episode?",
      "description": "Attack on Titan has returned to television with the Conclusion Arc. Friday’s episode, The Final Chapters (Part One), was an hour-long special broadcast that combined three episodes together. It ended on a cliffhanger, keeping the fans eager to know what happe…",
      "url": "https://winteriscoming.net/2023/03/06/when-will-attack-on-titan-return-for-final-episode/",
      "urlToImage": "https://images2.minutemediacdn.com/image/fetch/w_2000,h_2000,c_fit/https%3A%2F%2Fwinteriscoming.net%2Ffiles%2F2023%2F03%2FScreen-Shot-2023-03-06-at-1.22.44-PM.jpg",
      "publishedAt": "2023-03-06T19:34:29Z",
      "content": "Attack on Titan has returned to television with the Conclusion Arc.\r\nFriday’s episode, The Final Chapters (Part One), was an hour-long special broadcast that combined three episodes together. It ende… [+1914 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Pajiba.com"
      },
      "author": "Kayleigh Donaldson",
      "title": "Box Office Report: Creed Crushes Ants",
      "description": "The Rocky/Creed franchise has long proven itself to be one of immense financial clout, and Michael B. Jordan is continuing that proud trend with Creed III. The film marks his directorial debut as well as his third time in the...",
      "url": "https://www.pajiba.com/film_reviews/box-office-report-creed-iii-takes-top-spot-as-quantumania-stumbles-further.php",
      "urlToImage": "https://www.pajiba.com/assets_c/2023/03/Jonathan%20Majors%20Michael%20B%20Jordan%20Getty-thumb-700xauto-251978.jpg",
      "publishedAt": "2023-03-06T14:30:00Z",
      "content": "By Kayleigh Donaldson | Film | March 6, 2023 | \r\nBy Kayleigh Donaldson | Film | March 6, 2023 |\r\nThe Rocky/Creed franchise has long proven itself to be one of immense financial clout, and Michael B. … [+2266 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Playstation.com"
      },
      "author": "Aimee Dennett",
      "title": "Overwatch 2 x One-Punch Man Genos-Genji skin revealed",
      "description": "Overwatch 2 is teaming up with the world-renowned One-Punch Man anime to bring a set of collectible cosmetics to the game, available for a limited-time from March 7 – April 6! Overwatch 2 Associate Director Aimee Dennet and Art Director Dion Rogers share thei…",
      "url": "https://blog.playstation.com/2023/03/06/overwatch-2-x-one-punch-man-genos-genji-skin-revealed/",
      "urlToImage": "https://blog.playstation.com/tachyon/2023/03/66ddd5601f930a14a752fdd261a493a70b5613b7.jpg",
      "publishedAt": "2023-03-06T17:00:02Z",
      "content": "Overwatch 2 is teaming up with the world-renowned One-Punch Man anime to bring a set of collectible cosmetics to the game, available for a limited-time from March 7 April 6! Overwatch 2 Associate Dir… [+4186 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "GameSpot"
      },
      "author": "Luis Joshua Gutierrez",
      "title": "Overwatch's Fourth One Punch Man Skin Is Genos-Genji",
      "description": "Blizzard has revealed the fourth Overwatch 2 skin that'll be a part of the One Punch Man crossover event, with the attack hero Genji getting a Genos skin. Other heroes such as Kiriko, The Terrible Tornado, Mumen Rider Soldier 76, and Saitama Doomfist have bee…",
      "url": "https://www.gamespot.com/articles/overwatchs-fourth-one-punch-man-skin-is-genos-genji/1100-6512080/",
      "urlToImage": "https://www.gamespot.com/a/uploads/screen_kubrick/1746/17463818/4108366-onepunchmanoverwatch2.jpg",
      "publishedAt": "2023-03-06T18:58:00Z",
      "content": "Blizzard has revealed the fourth Overwatch 2 skin that'll be a part of the One Punch Man crossover event, with the attack hero Genji getting a Genos skin. Other heroes such as Kiriko, The Terrible To… [+1350 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "GameSpot"
      },
      "author": "Darryn Bonthuys",
      "title": "After 15 Years, Dragon Ball Z Budokai Is Finally Being Revived",
      "description": "After more than 15 years, Dragon Ball Z: Budokai Tenkaichi is getting a revival. Announced at the Dragon Ball Games Battle Hour 2023 event, Bandai Namco's reveal for the game started with a highlight reel of previous games in the series and culminated with a …",
      "url": "https://www.gamespot.com/articles/after-15-years-dragon-ball-z-budokai-is-finally-being-revived/1100-6512078/",
      "urlToImage": "https://www.gamespot.com/a/uploads/screen_kubrick/1601/16018044/4108363-goku-ssb.jpg",
      "publishedAt": "2023-03-06T18:26:00Z",
      "content": "After more than 15 years, Dragon Ball Z: Budokai Tenkaichi is getting a revival. Announced at the Dragon Ball Games Battle Hour 2023 event, Bandai Namco's reveal for the game started with a highlight… [+1796 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Randomc.net"
      },
      "author": "Choya",
      "title": "Trigun Stampede – 09",
      "description": "<table><tr><td></td><td></td><td></td></tr><tr><td></td><td></td><td></td></tr></table>\n[Millions Knives]\n\nDon't bring a gun to a Knives fight.",
      "url": "https://randomc.net/2023/03/06/trigun-stampede-09/",
      "urlToImage": null,
      "publishedAt": "2023-03-06T23:24:04Z",
      "content": "[Millions Knives]\r\nTrigun Stampedes latest episode segues from Vashs past to his current ordeal as he becomes familiarized once again with his latest parental figures, Brad and Luida. But as he revis… [+2812 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Den of Geek US"
      },
      "author": "Alec Bojalad",
      "title": "Does The Rumbling Prove That Eren Is Still Attack on Titan’s Hero?",
      "description": "NOTE: This author has not read the Attack on Titan manga ending upon which the Attack on Titan anime ending will likely be based. The following article presents an educated theory on how the anime could end and not a certainty based on the manga. “We took adv…",
      "url": "https://www.denofgeek.com/tv/does-the-rumbling-prove-that-eren-is-still-attack-on-titans-hero/",
      "urlToImage": "https://www.denofgeek.com/wp-content/uploads/2023/03/Attack-On-Titan-The-Final-Season-Part-3-Part-1-Rumbling.jpg?fit=2606%2C1448",
      "publishedAt": "2023-03-06T21:07:23Z",
      "content": "Ever since the start of Attack on Titans final season, the anime has teased the idea that the series heroic protagonist might actually be orchestrating something much more sinister. Its a dangerous g… [+4491 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Den of Geek US"
      },
      "author": "Matthew Byrd",
      "title": "Why Dragon Ball Z Fans Are Losing Their Minds Over the Budokai Tenkaichi 4 Reveal",
      "description": "Out of nowhere, Bandai Namco decided to end the Dragon Ball Games Battle Hour event with the surprise reveal of Dragon Ball Z Budokai Tenkaichi 4, and audiences are losing their collective minds. Some people are probably wondering what’s the big deal. Why dev…",
      "url": "https://www.denofgeek.com/games/dragon-ball-z-budokai-tenkaichi-4-reveal-fan-reactions/",
      "urlToImage": "https://www.denofgeek.com/wp-content/uploads/2023/03/Dragon-Ball-Z.jpg",
      "publishedAt": "2023-03-06T20:58:39Z",
      "content": "More importantly, the Budokai Tenkaichi games were a love letter to every facet of the franchise, no matter how small. For example, the third entry in the series had 98 characters with 161 forms betw… [+2949 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "GoNintendo"
      },
      "author": "rawmeatcowboy",
      "title": "God of Rock 'Final Flames' soundtrack sample released",
      "description": "Rock out",
      "url": "https://gonintendo.com/contents/17149-god-of-rock-final-flames-soundtrack-sample-released",
      "urlToImage": "https://gonintendo.com/attachments/image/24362/file/medium-2ea18d580d8b5647f519cf58fdc2960f.jpg",
      "publishedAt": "2023-03-06T20:24:00Z",
      "content": "Modus Games previously announced that God of Rock will open its world tour on April 18, 2023, unleashing a stacked setlist of energetic tracks that players will need to master to perform devastating … [+1320 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Cgchannel.com"
      },
      "author": "Jim Thacker",
      "title": "Stability.ai releases its Stable Diffusion add-on for Blender",
      "description": "Stability for Blender puts the AI image generator into Blender - for animation as well as still images.",
      "url": "https://www.cgchannel.com/2023/03/stability-ai-releases-stable-diffusion-addon-for-blender/",
      "urlToImage": "",
      "publishedAt": "2023-03-06T10:14:36Z",
      "content": "Stability.ai has released Stability for Blender, a free add-on that integrates Stable Diffusion into Blender.\r\nThe tool makes it possible to use the open-source AI image generation model inside Blend… [+3254 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Belloflostsouls.net"
      },
      "author": "Meaghan Colleran",
      "title": "Let’s Get to the Heart of the Cards With ‘Yu-Gi-Oh!’",
      "description": "Yu-Gi-Oh! is one of the most popular and longest-running animes out there. But what made this manga about games such a phenomenon? Yu-Gi-Oh! was one of the most popular anime series of an entire generation. What started as a pretty unassuming manga series by …",
      "url": "https://www.belloflostsouls.net/2023/03/lets-get-to-the-heart-of-the-cards-with-yu-gi-oh.html",
      "urlToImage": "https://www.belloflostsouls.net/wp-content/uploads/2023/03/yugioh-feat.-e1678073224930.webp",
      "publishedAt": "2023-03-06T14:00:08Z",
      "content": "Yu-Gi-Oh! is one of the most popular and longest-running animes out there. But what made this manga about games such a phenomenon?\r\nYu-Gi-Oh! was one of the most popular anime series of an entire gen… [+3733 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Belloflostsouls.net"
      },
      "author": "Meaghan Colleran",
      "title": "Fight For Love & Peace With This’Trigun’ Vash the Stampede Cosplay",
      "description": "This week we’re traveling the desert to spread love and peace and maybe get into a gunfight or two with this Vash the Stampede cosplay. Trigun is one of the latest animes to get the reboot and reimagine treatment. Despite the dubiousness that many of us have …",
      "url": "https://www.belloflostsouls.net/2023/03/fight-for-love-and-peace-with-this-vash-the-stampede-cospaly.html",
      "urlToImage": "https://www.belloflostsouls.net/wp-content/uploads/2023/03/nonbinate-vash-feat.jpg",
      "publishedAt": "2023-03-06T20:00:00Z",
      "content": "This week we’re traveling the desert to spread love and peace and maybe get into a gunfight or two with this Vash the Stampede cosplay.\r\nTrigun is one of the latest animes to get the reboot and reima… [+1642 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Belloflostsouls.net"
      },
      "author": "Mars Garrett",
      "title": "New Snikrot On the Way, Lelith Cosplay, and 40k Theories – Weekend Rewind",
      "description": "Dive into this weekend’s hottest news – Dark Angels theories, Snikrot is getting an upgrade, building lore accurate armies in 30k, and more. Warhammer 40K: Is Vashtorr About To Wake A Sleeping Lion? Vashtorr the Arkifane is about to launch an assault on The R…",
      "url": "https://www.belloflostsouls.net/2023/03/new-snikrot-on-the-way-lelith-cosplay-and-40k-theories-weekend-rewind.html",
      "urlToImage": "https://www.belloflostsouls.net/wp-content/uploads/2023/03/weekend-rewind-2.5.23.jpg",
      "publishedAt": "2023-03-06T07:00:17Z",
      "content": "Dive into this weekend’s hottest news – Dark Angels theories, Snikrot is getting an upgrade, building lore accurate armies in 30k, and more.\r\nVashtorr the Arkifane is about to launch an assault on Th… [+979 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Kotaku Australia"
      },
      "author": "Zack Zwiezen",
      "title": "Anime Voice Actor Asks Fans To Please Bathe Before Her Concert",
      "description": "Nerdy conventions and concerts can be a lot of fun, a great way to meet like-minded people and share your...\nThe post Anime Voice Actor Asks Fans To Please Bathe Before Her Concert appeared first on Kotaku Australia.",
      "url": "https://www.kotaku.com.au/2023/03/anime-voice-actor-asks-fans-to-please-bathe-before-her-concert/",
      "urlToImage": "https://www.kotaku.com.au/wp-content/uploads/sites/3/2023/03/07/c79c01d5511cd3e1d15f63d069f026be.jpg?quality=80&resize=1280,720",
      "publishedAt": "2023-03-06T22:25:00Z",
      "content": "Nerdy conventions and concerts can be a lot of fun, a great way to meet like-minded people and share your love of something with others. They also have a reputation for smelling bad, as certain peopl… [+2701 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Kotaku Australia"
      },
      "author": "Ruby Innes",
      "title": "Finally, A Persona Fan Game About The Golden Girls",
      "description": "If you’re anything like me, you’ve played Persona in the past and wondered, “But what are Rose, Dorothy, Sophia, and Blanche...\nThe post Finally, A Persona Fan Game About The Golden Girls appeared first on Kotaku Australia.",
      "url": "https://www.kotaku.com.au/2023/03/finally-a-persona-fan-game-about-the-golden-girls/",
      "urlToImage": "https://www.kotaku.com.au/wp-content/uploads/sites/3/2023/03/06/Screenshot-2023-03-06-143523.png?quality=80&resize=1280,720",
      "publishedAt": "2023-03-06T04:17:02Z",
      "content": "If you’re anything like me, you’ve played Persona in the past and wondered, “But what are Rose, Dorothy, Sophia, and Blanche right now? I wish I could go see what The Golden Girls are doing in this g… [+1927 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Kotaku Australia"
      },
      "author": "Ethan Gach",
      "title": "Beloved Dragon Ball Z Game Gets Sequel After 15 Years And Fans Are Losing It",
      "description": "No more waiting: after over a decade, a new Dragon Ball Z: Budokai Tenkaichi game is officially in development. Longtime...\nThe post Beloved Dragon Ball Z Game Gets Sequel After 15 Years And Fans Are Losing It appeared first on Kotaku Australia.",
      "url": "https://www.kotaku.com.au/2023/03/beloved-dragon-ball-z-game-gets-sequel-after-15-years-and-fans-are-losing-it/",
      "urlToImage": "https://www.kotaku.com.au/wp-content/uploads/sites/3/2023/03/07/f76acd722b6b8883390fdfc62c514e85.jpg?quality=80&resize=1280,720",
      "publishedAt": "2023-03-06T15:39:07Z",
      "content": "No more waiting: after over a decade, a new Dragon Ball Z: Budokai Tenkaichi game is officially in development. Longtime fans are losing their minds. Everyone else is hopelessly confused.\r\nThe new 3D… [+3868 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Kotaku Australia"
      },
      "author": "Sisi Jiang",
      "title": "Old G4 Review Is Forcing Gaming To Reckon With Its Racist JRPG Past",
      "description": "Last week, Final Fantasy producer Yoshida Naoki objected to the label “JRPG,” stating that the term felt “discriminatory.” His comments...\nThe post Old G4 Review Is Forcing Gaming To Reckon With Its Racist JRPG Past appeared first on Kotaku Australia.",
      "url": "https://www.kotaku.com.au/2023/03/old-g4-review-is-forcing-gaming-to-reckon-with-its-racist-jrpg-past/",
      "urlToImage": "https://www.kotaku.com.au/wp-content/uploads/sites/3/2023/03/07/763a8fb8dbfa4adf0380512764b16251.jpg?quality=80&resize=1280,720",
      "publishedAt": "2023-03-06T18:07:04Z",
      "content": "Last week, Final Fantasy producer Yoshida Naoki objected to the label JRPG, stating that the term felt discriminatory. His comments kicked off a round of discussion about whether or not the term JRPG… [+3995 chars]"
    },
    {
      "source": {
        "id": "abc-news",
        "name": "ABC News"
      },
      "author": "YURI KAGEYAMA Associated Press",
      "title": "Netflix making live-action 'One Piece' from popular manga",
      "description": "Hit Japanese manga “One Piece” is coming to Netflix as a live-action series — a development that’s both exciting and worrisome for fans who have seen mixed success in a growing list of Hollywood adaptations",
      "url": "https://abcnews.go.com/International/wireStory/netflix-making-live-action-piece-popular-manga-97646461",
      "urlToImage": "https://s.abcnews.com/images/International/wirestory_9a91e0fee9f15f8c0e4d98ddaba36f63_16x9_992.jpg",
      "publishedAt": "2023-03-06T02:02:44Z",
      "content": "TOKYO -- Hit Japanese manga One Piece is coming to Netflix as a live-action series a development that's both exciting and worrisome for fans who have seen mixed success in a growing list of Hollywood… [+4192 chars]"
    }
  ]
}
